//----------------------------------------------------------------------------------------------------------//
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//    I BBMMBB      BBMMBBI     BBI EEMMFFI BBMMI     BBI EEMMFFI BBMMI       BBMMBBI   EEMMI EEMMLL        //
//    EEI   EEFF  EEI   LLBB  EEMMBBI I BBEE  I EE  EEMMBBI I BBEE  I EE    EEI   LLBB    EEBBI I BB        //
//  I FF        I EE      BBI   EEI     EEI   I EE    EEI     EEI   I EE  I EE      BBI   EEI   I EE        //
//  LLFF        LLEE      EELL  EEI     EEI   I EE    EEI     EEI   I EE  LLEE      EELL  EEI   I EE        //
//  I EE      I I BB      EEI   EEI     EEI   I EE    EEI     EEI   I EE  I BB      EEI   EEI   I EE        //
//    BBLL  I I   BBFF  I EE    EEI     EEI   I BB    EEI     EEI   I BB    BBFF  I EE    BBI   I EE        //
//    I BBMMEE    I BBMMBB    EEMMMMLLBBMMBBLLMMMMEEEEMMMMLLBBMMBBLLMMMMEE  I BBMMBB    EEMMMMLLBBMMBB      //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//----------------------------------------------------------------------------------------------------------//
//                                                                                                          //
//                                                Scott System                                              //
//                                                                                                          //
//                               (c) Copyright 2007-2008, Scottyu China                                     //
//                                                                                                          //
//                                           All Rights Reserved                                            //
//                                                                                                          //
//                                                                                                          //
// File    : FesTypes.h                                                                                     //
// By      : scottyu                                                                                        //
// Version : V1.00                                                                                          //
// Time    : 2008-04-14 13:32:00                                                                            //
//                                                                                                          //
//----------------------------------------------------------------------------------------------------------//
//                                                                                                          //
// HISTORY                                                                                                  //
//                                                                                                          //
// 1 2008-04-14 13:32:00                                                                                    //
//                                                                                                          //
//                                                                                                          //
//                                                                                                          //
//----------------------------------------------------------------------------------------------------------//


#ifndef __FES_TYPES__H__
#define __FES_TYPES__H__ 1

#include "basetypes.h"


#define BLOCK_TYPE_INVALID		0x00000000	//!
#define BLOCK_TYPE_CODE			0x00000001	//!代码段
#define BLOCK_TYPE_DATA			0x00000002	//!数据段
//------------------------------------------------------------------------------------------------------------
//!和传统意义上的DATA段一样，已经占文件大小，也有初始值
//------------------------------------------------------------------------------------------------------------
#define BLOCK_TYPE_BSS_DATA		0x00000004	
//------------------------------------------------------------------------------------------------------------
//!和传统意义上的BSS段一样，没有占用文件，加载时候分配地址，并初始化为zero
//------------------------------------------------------------------------------------------------------------
#define BLOCK_TYPE_BSS_ZERO		0x00000008	
#define BLOCK_TYPE_CODE_DATA	0x00000010	//!代码数据混合段
#define BLOCK_TYPE_OTHER		0x00000011	//!其余，加载器不对齐解析


//------------------------------------------------------------------------------------------------------------
//!block数据结构
//------------------------------------------------------------------------------------------------------------
typedef struct tag_FesBlock{	
	u32		type ;		        //!类型，如TH_BLOCK_ITEM_TYPE_CODE
	u32		addr;		        //!相应block的起始虚拟地址
	u8 *	buffer;		        //!相应block
	u32		len;		        //!相应block的长度
	u32		flag;		        //!属性信息
}FesBlock_t;


//------------------------------------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------------------------------------
#define FES_FILE_NAME_LEN		256             //! 16byte ascii code
#define FES_MAGIC				0x20060623
#define FES_VERSION             0x00000100       
#define MAX_BLOCK               8 

//------------------------------------------------------------------------------------------------------------
//fes 数据结构
//------------------------------------------------------------------------------------------------------------
typedef struct tag_FesInfo
{
	u32             magic;						//!必须为 FES_MAGIC
	u32             version;					//!文件版本 FES_VERSION	
	u32             entry_point;				//!开始执行的地址
	s8              file_name[FES_FILE_NAME_LEN];//!fes的名字
	FesBlock_t      block[MAX_BLOCK];		
}FesInfo_t;

//------------------------------------------------------------------------------------------------------------
// THE END
//------------------------------------------------------------------------------------------------------------

#endif //__FES_TYPES__H__

